# PANDAS
#### Salah satu Library Python yang digunakan untuk Data Analisis


* Missing Data

Pengelolahan pada data yang kosong pada suatu DataFrame

* Group By

Pengelompokan Beberapa Data menggunakan suatu key

In [1]:
import numpy as np
import pandas as pd

#### Missing Data

In [58]:
df = pd.DataFrame({"A":[1, 2, 3, 4],
                  "B":[5, np.nan, np.nan, 8],
                  "C":[np.nan, np.nan, np.nan, np.nan],
                  "D":[12, 13, 14, np.nan]})

In [59]:
df

   A    B   C     D
0  1  5.0 NaN  12.0
1  2  NaN NaN  13.0
2  3  NaN NaN  14.0
3  4  8.0 NaN   NaN

In [32]:
# Menghapus data kosong saat di tampilkan | dropna(axis=0/1) default axis = 0
# axis = 0 (Untuk Baris) | axis = 1 (Untuk Kolom)

df.dropna(axis=1)

   A
0  1
1  2
2  3
3  4

In [38]:
df.dropna(thresh=2)

   A    B   C     D
0  1  5.0 NaN  12.0
1  2  NaN NaN  13.0
2  3  NaN NaN  14.0
3  4  8.0 NaN   NaN

In [44]:
# Parameter how bernilai any / all | any = menghapus baris/kolom data yang memiliki satu atau lebih data kosong.
# all = menghapus baris/kolom data yang semua datanya adalah kosong.

df.dropna(axis=1, how='any')

   A
0  1
1  2
2  3
3  4

In [49]:
df.dropna(subset=["D"])

   A    B   C     D
0  1  5.0 NaN  12.0
1  2  NaN NaN  13.0
2  3  NaN NaN  14.0

In [69]:
# Method fillna berfungsi untuk merubah nilai data kosong

df.fillna(value="New Value")

   A          B          C          D
0  1          5  New Value         12
1  2  New Value  New Value         13
2  3  New Value  New Value         14
3  4          8  New Value  New Value

In [68]:
df.fillna(value=df['A'].mean())

   A    B    C     D
0  1  5.0  2.5  12.0
1  2  2.5  2.5  13.0
2  3  2.5  2.5  14.0
3  4  8.0  2.5   2.5

#### GroupBy

In [70]:
df2 = pd.DataFrame({"Kelompok":["A", "B", "C", "A", "B", "C"],
                   "Nama":["Budi", "Adi", "Riri", "Dedik", "Yanto", "Yanti"],
                   "Umur":[20, 19, 23, 21, 20, 18]})

In [71]:
df2

  Kelompok   Nama  Umur
0        A   Budi    20
1        B    Adi    19
2        C   Riri    23
3        A  Dedik    21
4        B  Yanto    20
5        C  Yanti    18

In [72]:
# Method groupby berfungsi mengelompokan data-data berdasarkan nama kolom yang dipanggil dan melakukan perintah matematik
# secara otomatis akan mentarget pada kolom yang bernilai number | groupby(Nama_kolom)

df2.groupby("Kelompok")

In [77]:
kel = df2.groupby("Kelompok")

In [78]:
# Menghitung rata-rata setiap kelompok data

kel.mean()

          Umur
Kelompok
A         20.5
B         19.5
C         20.5

In [81]:
df2.groupby("Kelompok").mean()

          Umur
Kelompok
A         20.5
B         19.5
C         20.5

In [82]:
# Mencari nilai simpang baku

kel.std()

              Umur
Kelompok
A         0.707107
B         0.707107
C         3.535534

In [83]:
# More Examples

kel.min()

          Nama  Umur
Kelompok
A         Budi    20
B          Adi    19
C         Riri    18

In [84]:
kel.max()

           Nama  Umur
Kelompok
A         Dedik    21
B         Yanto    20
C         Yanti    23

In [95]:
# pemanggilan by kolom

kel.count()["Umur"]

Kelompok
A    2
B    2
C    2
Name: Umur, dtype: int64

In [87]:
# Method describe akan menampilkan perhitungan-perhitungan tersebut

kel.describe()

          Umur
         count  mean       std   min    25%   50%    75%   max
Kelompok
A          2.0  20.5  0.707107  20.0  20.25  20.5  20.75  21.0
B          2.0  19.5  0.707107  19.0  19.25  19.5  19.75  20.0
C          2.0  20.5  3.535534  18.0  19.25  20.5  21.75  23.0

In [98]:
# Pemanggilan berdasarkan Nama_Baris menggunkan method transpose()

kel.describe().transpose()["A"]

Umur  count     2.000000
      mean     20.500000
      std       0.707107
      min      20.000000
      25%      20.250000
      50%      20.500000
      75%      20.750000
      max      21.000000
Name: A, dtype: float64